---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
source: html/1fecebfd-6ae8-e4bc-8d78-b8101416df4c.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.SetColor Method

Sets the vertex's color.

## Syntax (C#)
```csharp
public void SetColor(
	ColorWithTransparency color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.ColorWithTransparency`) - The vertex's color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null